Австралия/src/Catalogs/HardwareDrivers/HardwareDrivers.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>HardwareDrivers</name>
  <predefined>
    <items>
      <name>ObsoleteDriver1CBarCodeScanners</name>
      <description>(not used) 1C: Barcode scanners (COM)</description>
    </items>
    <items>
      <name>ObsoleteDriver1CFiscalRegistersEmulator</name>
      <description>(not used) 1C: Fiscal register (emulator)</description>
    </items>
    <items>
      <name>ObsoleteDriver1CMagneticCardReaders</name>
      <description>(not used) 1C: magnetic card readers</description>
    </items>
    <items>
      <name>ObsoleteDriverTremolFiscalRegisters</name>
      <description>(not used) Tremol: Fiscal register</description>
    </items>
    <items>
      <name>ObsoleteDriverZekaFiscalRegisters</name>
      <description>(not used) Zeka: Fiscal register</description>
    </items>
    <items>
      <name>Driver1CBarCodeScannersNative</name>
      <description>1C: Barcode scanners (NativeApi)</description>
    </items>
  </predefined>
  <attributes>
    <name>EquipmentType</name>
    <type>
      <types>EnumRef.PeripheralTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>ObjectID</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>DriverHandler</name>
    <type>
      <types>EnumRef.PeripheralDriverHandlers</types>
    </type>
  </attributes>
  <attributes>
    <name>SuppliedAsDistribution</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ExportedDriver</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>DriverFileName</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>DriverTemplateName</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>DriverVersion</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Австралия/src/Catalogs/HardwareDrivers/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventHandlers

Procedure ChoiceDataGetProcessing(ChoiceData, Parameters, StandardProcessing)
	
	NativeLanguagesSupportServer.ChoiceDataGetProcessing(
		ChoiceData,
		Parameters,
		StandardProcessing,
		Metadata.Catalogs.HardwareDrivers);
	
EndProcedure

Procedure PresentationGetProcessing(Data, Presentation, StandardProcessing)
	
	NationalLanguageSupportClientServer.PresentationGetProcessing(Data, Presentation, StandardProcessing);
	
EndProcedure

Procedure PresentationFieldsGetProcessing(Fields, StandardProcessing)
	
	NationalLanguageSupportClientServer.PresentationFieldsGetProcessing(Fields, StandardProcessing);
	
EndProcedure

#EndRegion
	
#Region ProgramInterface
	
// Function restores a structure with
// data of hardware driver (with catalog item attributes values).
//
Function GetDriverData(ID) Export

	DriverData = New Structure();

	Query = New Query("
	|SELECT
	|	SpmHardwareDrivers.Ref,
	|	SpmHardwareDrivers.PredefinedDataName AS Name,
	|	SpmHardwareDrivers.EquipmentType AS EquipmentType,
	|	FALSE AS AsConfigurationPart,
	|	SpmHardwareDrivers.ObjectID AS ObjectID, 
	|	SpmHardwareDrivers.DriverHandler AS DriverHandler,
	|	SpmHardwareDrivers.SuppliedAsDistribution AS SuppliedAsDistribution, 
	|	SpmHardwareDrivers.ExportedDriver AS ExportedDriver,  
	|	SpmHardwareDrivers.DriverFileName  AS DriverFileName,  
	|	SpmHardwareDrivers.DriverTemplateName AS DriverTemplateName,
	|	SpmHardwareDrivers.DriverVersion    AS DriverVersion
	|FROM
	|	Catalog.HardwareDrivers AS SpmHardwareDrivers
	|WHERE
	|	 SpmHardwareDrivers.Ref = &ID");
	
	Query.SetParameter("ID", ID);
	
	Selection = Query.Execute().Select();
	                                                           
	If Selection.Next() Then
		// Fill the device data structure.
		DriverData.Insert("HardwareDriver"       , Selection.Ref);
		DriverData.Insert("HardwareDriverActualName"    , Selection.Name);
		DriverData.Insert("EquipmentType"           , Selection.EquipmentType);
		DriverData.Insert("AsConfigurationPart"      , Selection.AsConfigurationPart);
		DriverData.Insert("ObjectID"      , Selection.ObjectID);
		DriverData.Insert("DriverHandler"        , Selection.DriverHandler);
		DriverData.Insert("SuppliedAsDistribution" , Selection.SuppliedAsDistribution);
		DriverData.Insert("DriverTemplateName"         , Selection.DriverTemplateName);
		DriverData.Insert("DriverFileName"          , Selection.DriverFileName);
		DriverData.Insert("DriverVersion"            , Selection.DriverVersion);
	EndIf;
	
	Return DriverData;
	
	
EndFunction

Procedure FillPredefinedItem(DriverHandler, ObjectID = Undefined, DriverTemplateName = Undefined, SuppliedAsDistribution = False, DriverVersion = Undefined) Export
	
	Parameters = EquipmentManagerServerCall.GetDriverParametersForProcessor(String(DriverHandler));
	
	TempItemName = StrReplace(Parameters.Name, "Handler", "Driver");
	
	Try
		Driver = EquipmentManagerServerCall.PredefinedItem("Catalog.HardwareDrivers." + TempItemName);
	Except
		Message = NStr("en = 'Predefined item %Parameter% is not found.'; ru = 'Предопределенный элемент ""%Parameter%"" не найден.';pl = 'Nie znaleziono predefiniowanego elementu %Parameter%.';es_ES = 'Artículo predefinido %Parameter% no encontrado.';es_CO = 'Artículo predefinido %Parameter% no encontrado.';tr = 'Öntanımlı öğe %Parameter% bulunamadı.';it = 'L''elemento predefinito ""%Parameter%"" non è stato trovato.';de = 'Vordefinierter Artikel %Parameter% wurde nicht gefunden.'");
		Message = StrReplace(Message, "%Parameter%", "Catalog.HardwareDrivers." + TempItemName);
		Raise Message;
	EndTry;
		
	If Driver = Undefined Then  
		Driver = Catalogs.HardwareDrivers.CreateItem();
	Else 
		Driver = Driver.GetObject();
	EndIf;
	
	Driver.PredefinedDataName = TempItemName;     
	Driver.EquipmentType           = Parameters.EquipmentType;
	Driver.DriverHandler        = DriverHandler;
	Driver.Description              = Parameters.Description;
	Driver.ObjectID      = ObjectID;
	Driver.DriverTemplateName         = DriverTemplateName; 
	Driver.SuppliedAsDistribution = SuppliedAsDistribution;
	Driver.DriverVersion            = DriverVersion;
	Driver.Write();
	
EndProcedure

#EndRegion

#EndIf
